; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-4-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	s14 - location
	p0-7 - location
	p1-12 - location
	p2-4 - location
	p3-0 - location
	p3-1 - location
	p3-2 - location
	p3-13 - location
	p4-3 - location
	p4-10 - location
	p5-6 - location
	p5-7 - location
	p5-8 - location
	p6-11 - location
	p7-2 - location
	p8-0 - location
	p8-3 - location
	p8-9 - location
	p9-14 - location
	p10-6 - location
	p11-3 - location
	p11-4 - location
	p11-9 - location
	p12-0 - location
	p12-5 - location
	p12-13 - location
	p13-5 - location
	p13-8 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s4)
	(at driver3 s0)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s7)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at package1 s9)
	(at package2 s6)
	(at package3 s12)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(= (time-to-walk s0 p0-7) 71)
	(= (time-to-walk p0-7 s0) 71)
	(= (time-to-walk s7 p0-7) 36)
	(= (time-to-walk p0-7 s7) 36)
	(path s1 p1-12)
	(path p1-12 s1)
	(path s12 p1-12)
	(path p1-12 s12)
	(= (time-to-walk s1 p1-12) 11)
	(= (time-to-walk p1-12 s1) 11)
	(= (time-to-walk s12 p1-12) 11)
	(= (time-to-walk p1-12 s12) 11)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 66)
	(= (time-to-walk p2-4 s2) 66)
	(= (time-to-walk s4 p2-4) 33)
	(= (time-to-walk p2-4 s4) 33)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 96)
	(= (time-to-walk p3-0 s3) 96)
	(= (time-to-walk s0 p3-0) 70)
	(= (time-to-walk p3-0 s0) 70)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 61)
	(= (time-to-walk p3-1 s3) 61)
	(= (time-to-walk s1 p3-1) 34)
	(= (time-to-walk p3-1 s1) 34)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 13)
	(= (time-to-walk p3-2 s3) 13)
	(= (time-to-walk s2 p3-2) 20)
	(= (time-to-walk p3-2 s2) 20)
	(path s3 p3-13)
	(path p3-13 s3)
	(path s13 p3-13)
	(path p3-13 s13)
	(= (time-to-walk s3 p3-13) 17)
	(= (time-to-walk p3-13 s3) 17)
	(= (time-to-walk s13 p3-13) 45)
	(= (time-to-walk p3-13 s13) 45)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 44)
	(= (time-to-walk p4-3 s4) 44)
	(= (time-to-walk s3 p4-3) 60)
	(= (time-to-walk p4-3 s3) 60)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(= (time-to-walk s4 p4-10) 97)
	(= (time-to-walk p4-10 s4) 97)
	(= (time-to-walk s10 p4-10) 16)
	(= (time-to-walk p4-10 s10) 16)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 40)
	(= (time-to-walk p5-6 s5) 40)
	(= (time-to-walk s6 p5-6) 6)
	(= (time-to-walk p5-6 s6) 6)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(= (time-to-walk s5 p5-7) 43)
	(= (time-to-walk p5-7 s5) 43)
	(= (time-to-walk s7 p5-7) 45)
	(= (time-to-walk p5-7 s7) 45)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(= (time-to-walk s5 p5-8) 69)
	(= (time-to-walk p5-8 s5) 69)
	(= (time-to-walk s8 p5-8) 29)
	(= (time-to-walk p5-8 s8) 29)
	(path s6 p6-11)
	(path p6-11 s6)
	(path s11 p6-11)
	(path p6-11 s11)
	(= (time-to-walk s6 p6-11) 39)
	(= (time-to-walk p6-11 s6) 39)
	(= (time-to-walk s11 p6-11) 10)
	(= (time-to-walk p6-11 s11) 10)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(= (time-to-walk s7 p7-2) 4)
	(= (time-to-walk p7-2 s7) 4)
	(= (time-to-walk s2 p7-2) 83)
	(= (time-to-walk p7-2 s2) 83)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(= (time-to-walk s8 p8-0) 94)
	(= (time-to-walk p8-0 s8) 94)
	(= (time-to-walk s0 p8-0) 4)
	(= (time-to-walk p8-0 s0) 4)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(= (time-to-walk s8 p8-3) 55)
	(= (time-to-walk p8-3 s8) 55)
	(= (time-to-walk s3 p8-3) 64)
	(= (time-to-walk p8-3 s3) 64)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(= (time-to-walk s8 p8-9) 40)
	(= (time-to-walk p8-9 s8) 40)
	(= (time-to-walk s9 p8-9) 66)
	(= (time-to-walk p8-9 s9) 66)
	(path s9 p9-14)
	(path p9-14 s9)
	(path s14 p9-14)
	(path p9-14 s14)
	(= (time-to-walk s9 p9-14) 75)
	(= (time-to-walk p9-14 s9) 75)
	(= (time-to-walk s14 p9-14) 5)
	(= (time-to-walk p9-14 s14) 5)
	(path s10 p10-6)
	(path p10-6 s10)
	(path s6 p10-6)
	(path p10-6 s6)
	(= (time-to-walk s10 p10-6) 98)
	(= (time-to-walk p10-6 s10) 98)
	(= (time-to-walk s6 p10-6) 71)
	(= (time-to-walk p10-6 s6) 71)
	(path s11 p11-3)
	(path p11-3 s11)
	(path s3 p11-3)
	(path p11-3 s3)
	(= (time-to-walk s11 p11-3) 75)
	(= (time-to-walk p11-3 s11) 75)
	(= (time-to-walk s3 p11-3) 59)
	(= (time-to-walk p11-3 s3) 59)
	(path s11 p11-4)
	(path p11-4 s11)
	(path s4 p11-4)
	(path p11-4 s4)
	(= (time-to-walk s11 p11-4) 4)
	(= (time-to-walk p11-4 s11) 4)
	(= (time-to-walk s4 p11-4) 87)
	(= (time-to-walk p11-4 s4) 87)
	(path s11 p11-9)
	(path p11-9 s11)
	(path s9 p11-9)
	(path p11-9 s9)
	(= (time-to-walk s11 p11-9) 78)
	(= (time-to-walk p11-9 s11) 78)
	(= (time-to-walk s9 p11-9) 20)
	(= (time-to-walk p11-9 s9) 20)
	(path s12 p12-0)
	(path p12-0 s12)
	(path s0 p12-0)
	(path p12-0 s0)
	(= (time-to-walk s12 p12-0) 31)
	(= (time-to-walk p12-0 s12) 31)
	(= (time-to-walk s0 p12-0) 22)
	(= (time-to-walk p12-0 s0) 22)
	(path s12 p12-5)
	(path p12-5 s12)
	(path s5 p12-5)
	(path p12-5 s5)
	(= (time-to-walk s12 p12-5) 79)
	(= (time-to-walk p12-5 s12) 79)
	(= (time-to-walk s5 p12-5) 28)
	(= (time-to-walk p12-5 s5) 28)
	(path s12 p12-13)
	(path p12-13 s12)
	(path s13 p12-13)
	(path p12-13 s13)
	(= (time-to-walk s12 p12-13) 37)
	(= (time-to-walk p12-13 s12) 37)
	(= (time-to-walk s13 p12-13) 18)
	(= (time-to-walk p12-13 s13) 18)
	(path s13 p13-5)
	(path p13-5 s13)
	(path s5 p13-5)
	(path p13-5 s5)
	(= (time-to-walk s13 p13-5) 33)
	(= (time-to-walk p13-5 s13) 33)
	(= (time-to-walk s5 p13-5) 80)
	(= (time-to-walk p13-5 s5) 80)
	(path s13 p13-8)
	(path p13-8 s13)
	(path s8 p13-8)
	(path p13-8 s8)
	(= (time-to-walk s13 p13-8) 63)
	(= (time-to-walk p13-8 s13) 63)
	(= (time-to-walk s8 p13-8) 1)
	(= (time-to-walk p13-8 s8) 1)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 9)
	(= (time-to-drive s3 s0) 9)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 2)
	(= (time-to-drive s9 s0) 2)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 11)
	(= (time-to-drive s0 s1) 11)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 12)
	(= (time-to-drive s3 s1) 12)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 84)
	(= (time-to-drive s4 s1) 84)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 5)
	(= (time-to-drive s5 s1) 5)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 16)
	(= (time-to-drive s6 s1) 16)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 38)
	(= (time-to-drive s8 s1) 38)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 69)
	(= (time-to-drive s7 s2) 69)
	(link s3 s14)
	(link s14 s3)
	(= (time-to-drive s3 s14) 55)
	(= (time-to-drive s14 s3) 55)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 3)
	(= (time-to-drive s11 s4) 3)
	(link s4 s14)
	(link s14 s4)
	(= (time-to-drive s4 s14) 43)
	(= (time-to-drive s14 s4) 43)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 60)
	(= (time-to-drive s0 s5) 60)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 1)
	(= (time-to-drive s4 s5) 1)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 13)
	(= (time-to-drive s8 s5) 13)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 34)
	(= (time-to-drive s10 s5) 34)
	(link s5 s12)
	(link s12 s5)
	(= (time-to-drive s5 s12) 59)
	(= (time-to-drive s12 s5) 59)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 16)
	(= (time-to-drive s3 s6) 16)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 20)
	(= (time-to-drive s8 s6) 20)
	(link s6 s13)
	(link s13 s6)
	(= (time-to-drive s6 s13) 37)
	(= (time-to-drive s13 s6) 37)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 35)
	(= (time-to-drive s0 s7) 35)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 51)
	(= (time-to-drive s5 s7) 51)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 59)
	(= (time-to-drive s8 s7) 59)
	(link s7 s10)
	(link s10 s7)
	(= (time-to-drive s7 s10) 14)
	(= (time-to-drive s10 s7) 14)
	(link s8 s10)
	(link s10 s8)
	(= (time-to-drive s8 s10) 78)
	(= (time-to-drive s10 s8) 78)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 96)
	(= (time-to-drive s1 s9) 96)
	(link s9 s5)
	(link s5 s9)
	(= (time-to-drive s9 s5) 32)
	(= (time-to-drive s5 s9) 32)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 11)
	(= (time-to-drive s8 s9) 11)
	(link s9 s13)
	(link s13 s9)
	(= (time-to-drive s9 s13) 76)
	(= (time-to-drive s13 s9) 76)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 94)
	(= (time-to-drive s9 s10) 94)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 12)
	(= (time-to-drive s3 s11) 12)
	(link s11 s7)
	(link s7 s11)
	(= (time-to-drive s11 s7) 84)
	(= (time-to-drive s7 s11) 84)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 96)
	(= (time-to-drive s9 s11) 96)
	(link s11 s13)
	(link s13 s11)
	(= (time-to-drive s11 s13) 22)
	(= (time-to-drive s13 s11) 22)
	(link s11 s14)
	(link s14 s11)
	(= (time-to-drive s11 s14) 95)
	(= (time-to-drive s14 s11) 95)
	(link s12 s2)
	(link s2 s12)
	(= (time-to-drive s12 s2) 79)
	(= (time-to-drive s2 s12) 79)
	(link s12 s3)
	(link s3 s12)
	(= (time-to-drive s12 s3) 27)
	(= (time-to-drive s3 s12) 27)
	(link s12 s4)
	(link s4 s12)
	(= (time-to-drive s12 s4) 11)
	(= (time-to-drive s4 s12) 11)
	(link s12 s11)
	(link s11 s12)
	(= (time-to-drive s12 s11) 16)
	(= (time-to-drive s11 s12) 16)
	(link s12 s13)
	(link s13 s12)
	(= (time-to-drive s12 s13) 95)
	(= (time-to-drive s13 s12) 95)
	(link s13 s0)
	(link s0 s13)
	(= (time-to-drive s13 s0) 65)
	(= (time-to-drive s0 s13) 65)
	(link s13 s7)
	(link s7 s13)
	(= (time-to-drive s13 s7) 19)
	(= (time-to-drive s7 s13) 19)
	(link s14 s5)
	(link s5 s14)
	(= (time-to-drive s14 s5) 37)
	(= (time-to-drive s5 s14) 37)
	(link s14 s12)
	(link s12 s14)
	(= (time-to-drive s14 s12) 25)
	(= (time-to-drive s12 s14) 25)
	(link s14 s13)
	(link s13 s14)
	(= (time-to-drive s14 s13) 19)
	(= (time-to-drive s13 s14) 19)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s5)
	(at driver2 s3)
	(at driver3 s4)
	(at truck1 s8)
	(at truck2 s3)
	(at truck3 s10)
	(at package1 s12)
	(at package2 s11)
	(at package3 s0)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 3  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 1 of 9
2. (drive-truck truck2 s4 s1 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (driven) from 0 to 84
   goals met: 1 of 9
3. (drive-truck truck2 s1 s3 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (driven) from 84 to 96
   goals met: 2 of 9
4. (walk driver3 s0 p0-7)
   deleted: (at driver3 s0)
   added: (at driver3 p0-7)
   changed: (walked) from 0 to 71
   goals met: 2 of 9
5. (walk driver3 p0-7 s7)
   deleted: (at driver3 p0-7)
   added: (at driver3 s7)
   changed: (walked) from 71 to 107
   goals met: 2 of 9
6. (board-truck driver3 truck3 s7)
   deleted: (at driver3 s7) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 2 of 9
7. (disembark-truck driver2 truck2 s3)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 3 of 9
8. (drive-truck truck3 s7 s11 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s11)
   changed: (driven) from 96 to 180
   goals met: 3 of 9
9. (drive-truck truck3 s11 s9 driver3)
   deleted: (at truck3 s11)
   added: (at truck3 s9)
   changed: (driven) from 180 to 276
   goals met: 3 of 9
10. (load-truck package1 truck3 s9)
   deleted: (at package1 s9)
   added: (in package1 truck3)
   goals met: 3 of 9
11. (drive-truck truck3 s9 s11 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s11)
   changed: (driven) from 276 to 372
   goals met: 3 of 9
12. (drive-truck truck3 s11 s12 driver3)
   deleted: (at truck3 s11)
   added: (at truck3 s12)
   changed: (driven) from 372 to 388
   goals met: 3 of 9
13. (load-truck package3 truck3 s12)
   deleted: (at package3 s12)
   added: (in package3 truck3)
   goals met: 3 of 9
14. (unload-truck package1 truck3 s12)
   deleted: (in package1 truck3)
   added: (at package1 s12)
   goals met: 4 of 9
15. (drive-truck truck3 s12 s4 driver3)
   deleted: (at truck3 s12)
   added: (at truck3 s4)
   changed: (driven) from 388 to 399
   goals met: 4 of 9
16. (walk driver1 s5 p5-6)
   deleted: (at driver1 s5)
   added: (at driver1 p5-6)
   changed: (walked) from 107 to 147
   goals met: 3 of 9
17. (walk driver1 p5-6 s6)
   deleted: (at driver1 p5-6)
   added: (at driver1 s6)
   changed: (walked) from 147 to 153
   goals met: 3 of 9
18. (load-truck package2 truck1 s6)
   deleted: (at package2 s6)
   added: (in package2 truck1)
   goals met: 3 of 9
19. (board-truck driver1 truck1 s6)
   deleted: (at driver1 s6) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 3 of 9
20. (drive-truck truck1 s6 s8 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s8)
   changed: (driven) from 399 to 419
   goals met: 4 of 9
21. (drive-truck truck1 s8 s9 driver1)
   deleted: (at truck1 s8)
   added: (at truck1 s9)
   changed: (driven) from 419 to 430
   goals met: 3 of 9
22. (drive-truck truck3 s4 s5 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (driven) from 430 to 431
   goals met: 3 of 9
23. (drive-truck truck1 s9 s11 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s11)
   changed: (driven) from 431 to 527
   goals met: 3 of 9
24. (unload-truck package2 truck1 s11)
   deleted: (in package2 truck1)
   added: (at package2 s11)
   goals met: 4 of 9
25. (drive-truck truck1 s11 s9 driver1)
   deleted: (at truck1 s11)
   added: (at truck1 s9)
   changed: (driven) from 527 to 623
   goals met: 4 of 9
26. (drive-truck truck1 s9 s5 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s5)
   changed: (driven) from 623 to 655
   goals met: 4 of 9
27. (disembark-truck driver1 truck1 s5)
   deleted: (driving driver1 truck1)
   added: (at driver1 s5) (empty truck1)
   goals met: 5 of 9
28. (drive-truck truck3 s5 s0 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (driven) from 655 to 715
   goals met: 5 of 9
29. (unload-truck package3 truck3 s0)
   deleted: (in package3 truck3)
   added: (at package3 s0)
   goals met: 6 of 9
30. (drive-truck truck3 s0 s7 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s7)
   changed: (driven) from 715 to 750
   goals met: 6 of 9
31. (board-truck driver1 truck1 s5)
   deleted: (at driver1 s5) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 5 of 9
32. (drive-truck truck1 s5 s4 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   changed: (driven) from 750 to 751
   goals met: 5 of 9
33. (drive-truck truck3 s7 s11 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s11)
   changed: (driven) from 751 to 835
   goals met: 5 of 9
34. (drive-truck truck3 s11 s4 driver3)
   deleted: (at truck3 s11)
   added: (at truck3 s4)
   changed: (driven) from 835 to 838
   goals met: 5 of 9
35. (disembark-truck driver3 truck3 s4)
   deleted: (driving driver3 truck3)
   added: (at driver3 s4) (empty truck3)
   goals met: 6 of 9
36. (disembark-truck driver1 truck1 s4)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 6 of 9
37. (board-truck driver1 truck3 s4)
   deleted: (at driver1 s4) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 6 of 9
38. (drive-truck truck3 s4 s5 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (driven) from 838 to 839
   goals met: 6 of 9
39. (drive-truck truck3 s5 s10 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s10)
   changed: (driven) from 839 to 873
   goals met: 7 of 9
40. (board-truck driver3 truck1 s4)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 6 of 9
41. (drive-truck truck1 s4 s1 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (driven) from 873 to 957
   goals met: 6 of 9
42. (drive-truck truck1 s1 s8 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s8)
   changed: (driven) from 957 to 995
   goals met: 7 of 9
43. (disembark-truck driver3 truck1 s8)
   deleted: (driving driver3 truck1)
   added: (at driver3 s8) (empty truck1)
   goals met: 7 of 9
44. (drive-truck truck3 s10 s8 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s8)
   changed: (driven) from 995 to 1073
   goals met: 6 of 9
45. (disembark-truck driver1 truck3 s8)
   deleted: (driving driver1 truck3)
   added: (at driver1 s8) (empty truck3)
   goals met: 6 of 9
46. (board-truck driver3 truck3 s8)
   deleted: (at driver3 s8) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 6 of 9
47. (drive-truck truck3 s8 s10 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s10)
   changed: (driven) from 1073 to 1151
   goals met: 7 of 9
48. (walk driver1 s8 p5-8)
   deleted: (at driver1 s8)
   added: (at driver1 p5-8)
   changed: (walked) from 153 to 182
   goals met: 7 of 9
49. (disembark-truck driver3 truck3 s10)
   deleted: (driving driver3 truck3)
   added: (at driver3 s10) (empty truck3)
   goals met: 7 of 9
50. (walk driver1 p5-8 s5)
   deleted: (at driver1 p5-8)
   added: (at driver1 s5)
   changed: (walked) from 182 to 251
   goals met: 8 of 9
51. (walk driver3 s10 p4-10)
   deleted: (at driver3 s10)
   added: (at driver3 p4-10)
   changed: (walked) from 251 to 267
   goals met: 8 of 9
52. (walk driver3 p4-10 s4)
   deleted: (at driver3 p4-10)
   added: (at driver3 s4)
   changed: (walked) from 267 to 364
   goals met: 9 of 9
